app/View/Components/CategoryDropdown.php

SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'sequi-aperiam-fuga-cupiditate-consectetur' LIMIT 1
---
    public function render()
    {
        return view('components.category-dropdown',[
            'categories'=>Category::all(),
            'currentCategory'=> Category::firstWhere('slug', request('category'))
        ]);