app/Http/Controllers/PostController.php

    public function index()
    {

        return view('posts.index',[
            'posts' =>
                Post::latest()
                    ->filter(request(['search','category','author']))
                    ->simplePaginate(6)->withQueryString()

        ]);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 7 offset 0