app/Http/Controllers/RegisterController.php

    public function store()
    {
        $attributes = request()->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:3|max:255|unique:users,username',
            'email' => 'required|email|max:255|unique:users,email',
            'password' => 'required|min:7|max:255',
        ]);

        $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('chaima', 'chaima', 'chaima@gmail.com', '$2y$10$Dj3PRWdYrO89/maRdHzocOuE3ODS8T0BucCUdxp07WlPv/F5242le', '2024-08-01 10:40:29', '2024-08-01 10:40:29')